In [12]:
!pip install pymysql
!pip install sqlalchemy

Requirement already satisfied: pymysql in /Users/accountmanager/opt/anaconda3/lib/python3.9/site-packages (1.0.2)
Requirement already satisfied: sqlalchemy in /Users/accountmanager/opt/anaconda3/lib/python3.9/site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in /Users/accountmanager/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (1.1.1)

In [13]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass
password = getpass.getpass()

········

In [15]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

data1 = pd.read_sql_query('SELECT * FROM rentals_may', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [21]:
len(data1)

1156

In [16]:
data2 = pd.read_sql_query('SELECT * FROM rentals_june', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [22]:
len(data2)

2311

In [34]:
both_data = pd.concat([data1, data2], ignore_index=True)

In [42]:
both_data['Number per month'] = both_data['rental_date'].apply(lambda x: "%d" % (x.month))
count = both_data.groupby(['Number per month']).size()
count

Number per month
5    1156
6    2311
dtype: int64

In [33]:
def count_values()
    both_data['Number per month'] = both_data['rental_date'].apply(lambda x: "%d" % (x.month))
    count = both_data.groupby(['Number per month']).size()
    return count

0                                                            %M
1                                                            %M
2                                                            %M
3                                                            %M
4                                                            %M
                                    ...
3463                                                         %M
3464                                                         %M
3465                                                         %M
3466                                                         %M
Month/Year    0       5/2005
1       5/2005
2       5/2005
3...
Name: rental_date, Length: 3468, dtype: object